mistyk/inavradar-ESP32/src/main.cpp
}

void lora_send() {

    if (sys.lora_tick % 8 == 0) {

        if (sys.lora_tick % 16 == 0) {
            air_3.id = curr.id;
            air_3.type = 3;
            air_3.vbat = curr.fcanalog.vbat; // 1 to 255 (V x 10)
            air_3.mah = curr.fcanalog.mAhDrawn;
            air_3.rssi = curr.fcanalog.rssi; // 0 to 1023
            air_3.temp1 = 0;
            air_3.temp2 = 0;

            while (!LoRa.beginPacket()) {  }
            LoRa.write((uint8_t*)&air_3, sizeof(air_3));
            LoRa.endPacket(false);
        }
        else {
            air_2.id = curr.id;
            air_2.type = 2;
            air_2.host = curr.host;
            air_2.state = curr.state;
            strncpy(air_2.name, curr.name, LORA_NAME_LENGTH);
            air_2.temp1 = 0;

            while (!LoRa.beginPacket()) {  }
            LoRa.write((uint8_t*)&air_2, sizeof(air_2));
            LoRa.endPacket(false);
            }
    }
    else {

        if (sys.lora_tick % 2 == 0) {
            air_0.id = curr.id;
            air_0.type = 0;
            air_0.lat = curr.gps.lat / 100; // From XX.1234567 to XX.12345
            air_0.lon = curr.gps.lon / 100; // From XX.1234567 to XX.12345
            air_0.alt = curr.gps.alt; // m
            air_0.heading = curr.gps.groundCourse / 10;  // From degres x 10 to degres

            while (!LoRa.beginPacket()) {  }
            LoRa.write((uint8_t*)&air_0, sizeof(air_0));
            LoRa.endPacket(false);
        }
        else {
            air_1.id = curr.id;
            air_1.type = 1;
            air_1.lat = curr.gps.lat / 100; // From XX.1234567 to XX.12345
            air_1.lon = curr.gps.lon / 100; // From XX.1234567 to XX.12345
            air_1.alt = curr.gps.alt; // m
            air_1.speed = curr.gps.groundSpeed / 100; // From cm/s to m/s
            air_1.broadcast = 0;

            while (!LoRa.beginPacket()) {  }
            LoRa.write((uint8_t*)&air_1, sizeof(air_1));
            LoRa.endPacket(false);
        }
    }
}

void lora_receive(int packetSize) {

    if (packetSize == 0) return;

    sys.lora_last_rx = millis();
    sys.lora_last_rx -= (stats.last_tx_duration > 0 ) ? stats.last_tx_duration : 0; // RX time should be the same as TX time

    sys.last_rssi = LoRa.packetRssi();
    sys.ppsc++;

    LoRa.readBytes((uint8_t *)&air_0, packetSize);

    uint8_t id = air_0.id - 1;
    sys.air_last_received_id = air_0.id;
    peers[id].id = sys.air_last_received_id;
    peers[id].lq_tick++;
    peers[id].lost = 0;
    peers[id].updated = sys.lora_last_rx;
    peers[id].rssi = sys.last_rssi;

    if (air_0.type == 0) { // Type 0 packet

        peers[id].gps.lat = air_0.lat * 100; // From XX.12345 to XX.1234500
        peers[id].gps.lon = air_0.lon * 100; // From XX.12345 to XX.1234500
        peers[id].gps.alt = air_0.alt; // m
        peers[id].gps.groundCourse = air_0.heading * 10; // From degres to degres x 10
    }
    else if (air_0.type == 1) { // Type 1 packet

        air_r1 = (air_type1_t*)&air_0;

        peers[id].gps.lat = (*air_r1).lat * 100; // From XX.12345 to XX.1234500
        peers[id].gps.lon = (*air_r1).lon * 100; // From XX.12345 to XX.1234500
        peers[id].gps.alt = (*air_r1).alt; // m
        peers[id].gps.groundSpeed = (*air_r1).speed * 100; // From m/s to cm/s
        peers[id].broadcast = (*air_r1).broadcast;
    }
    else if (air_0.type == 2) { // Type 2 packet

        air_r2 = (air_type2_t*)&air_0;

        peers[id].host = (*air_r2).host;
        peers[id].state = (*air_r2).state;
        strncpy(peers[id].name, (*air_r2).name, LORA_NAME_LENGTH);
        peers[id].name[LORA_NAME_LENGTH] = 0;
    }
    else if (air_0.type == 3) { // Type 3 packet

        air_r3 = (air_type3_t*)&air_0;

        peers[id].fcanalog.vbat = (*air_r3).vbat;
        peers[id].fcanalog.mAhDrawn = (*air_r3).mah;
        peers[id].fcanalog.rssi = (*air_r3).rssi;
    }

    if ((air_0.type == 0 || air_0.type == 1) && peers[id].gps.lat != 0 && peers[id].gps.lon != 0 && peers[id].gps.alt != 0) {  // Save the last known coordinates
        peers[id].gpsrec.lat = peers[id].gps.lat;
        peers[id].gpsrec.lon = peers[id].gps.lon;
        peers[id].gpsrec.alt = peers[id].gps.alt;
        peers[id].gpsrec.groundCourse = peers[id].gps.groundCourse;
        peers[id].gpsrec.groundSpeed = peers[id].gps.groundSpeed;
    }

    sys.num_peers = count_peers();

    if ((sys.air_last_received_id == curr.id) && (sys.phase > MODE_LORA_SYNC) && !sys.lora_no_tx) { // Same slot, conflict
        uint32_t cs1 = peers[id].name[0] + peers[id].name[1] * 26 + peers[id].name[2] * 26 * 26 ;
        uint32_t cs2 = curr.name[0] + curr.name[1] * 26 + curr.name[2] * 26 * 26;
        if (cs1 < cs2) { // Pick another slot
            sprintf(sys.message, "%s", "ID CONFLICT");
            pick_id();
            resync_tx_slot(cfg.lora_timing_delay);
        }
    }
}

void lora_init() {

    SPI.begin(5, 19, 27, 18);
    LoRa.setPins(SS, RST, DI0);

    if (!LoRa.begin(cfg.lora_frequency)) {
        display.drawString (94, 9, "FAIL");
        while (1);
    }

    LoRa.sleep();
    LoRa.setSignalBandwidth(cfg.lora_bandwidth);
    LoRa.setCodingRate4(cfg.lora_coding_rate);
    LoRa.setSpreadingFactor(cfg.lora_spreading_factor);
    LoRa.setTxPower(cfg.lora_power, 1);
    LoRa.setOCP(250);
    LoRa.idle();
    LoRa.onReceive(lora_receive);
    LoRa.enableCrc();
}

// ----------------------------------------------------------------------------- Display

void display_init() {
    pinMode(16, OUTPUT);
    pinMode(2, OUTPUT);
    digitalWrite(16, LOW);
    delay(50);
    digitalWrite(16, HIGH);
    display.init();
    display.flipScreenVertically();
    display.setFont(ArialMT_Plain_10);
    display.setTextAlignment(TEXT_ALIGN_LEFT);
}

void display_draw() {
    display.clear();

    int j = 0;
    int line;

    if (sys.num_peers == 0 && sys.display_page == 1)  { // No need for timings graphs when alone
        sys.display_page++;
    }

    if (sys.display_page == 0) {

        display.setFont(ArialMT_Plain_24);
        display.setTextAlignment(TEXT_ALIGN_RIGHT);
        display.drawString(26, 11, String(curr.gps.numSat));
        display.drawString(13, 42, String(sys.num_peers_active + 1));
        display.drawString (125, 11, String(peer_slotname[curr.id]));

        display.setFont(ArialMT_Plain_10);

