mistyk/inavradar-ESP32/src/main.cpp
                display.setTextAlignment (TEXT_ALIGN_RIGHT);

                if (iscurrent) {
                    display.drawString (128, 24, "LA " + String((float)curr.gps.lat / 10000000, 6));
                    display.drawString (128, 34, "LO "+ String((float)curr.gps.lon / 10000000, 6));
                }
                else {
                    display.drawString (128, 24, "LA " + String((float)peers[i].gpsrec.lat / 10000000, 6));
                    display.drawString (128, 34, "LO "+ String((float)peers[i].gpsrec.lon / 10000000, 6));
                }

                display.setTextAlignment (TEXT_ALIGN_LEFT);

                if (iscurrent) {
                    display.drawString (0, 24, "A " + String(curr.gps.alt) + "m");
                    display.drawString (0, 34, "S " + String(peers[i].gpsrec.groundSpeed / 100) + "m/s");
                    display.drawString (0, 44, "C " + String(curr.gps.groundCourse / 10) + "°");
                }
                else {
                    display.drawString (0, 24, "A " + String(peers[i].gpsrec.alt) + "m");
                    display.drawString (0, 34, "S " + String(peers[i].gpsrec.groundSpeed / 100) + "m/s");
                    display.drawString (0, 44, "C " + String(peers[i].gpsrec.groundCourse / 10) + "°");
                }

                if (peers[i].gps.lat != 0 && peers[i].gps.lon != 0 && curr.gps.lat != 0 && curr.gps.lon != 0 && !iscurrent) {


                    double lat1 = curr.gps.lat / 10000000;
                    double lon1 = curr.gps.lon / 10000000;
                    double lat2 = peers[i].gpsrec.lat / 10000000;
                    double lon2 = peers[i].gpsrec.lon / 10000000;

                    peers[i].distance = gpsDistanceBetween(lat1, lon1, lat2, lon2);
                    peers[i].direction = gpsCourseTo(lat1, lon1, lat2, lon2);
                    peers[i].relalt = peers[i].gpsrec.alt - curr.gps.alt;

                    display.drawString (40, 44, "B " + String(peers[i].direction) + "°");
                    display.drawString (88, 44, "D " + String(peers[i].distance) + "m");
                    display.drawString (0, 54, "R " + String(peers[i].relalt) + "m");
                }

                if (iscurrent) {
                    display.drawString (40, 54, String((float)curr.fcanalog.vbat / 10) + "v");
                    display.drawString (88, 54, String((int)curr.fcanalog.mAhDrawn) + "mah");
                }
                else {
                    display.drawString (40, 54, String((float)peers[i].fcanalog.vbat / 10) + "v");
                    display.drawString (88, 54, String((int)peers[i].fcanalog.mAhDrawn) + "mah");
                }

            display.setTextAlignment (TEXT_ALIGN_RIGHT);

        }
        else {
            display.drawString (35, 7, "SLOT IS EMPTY");
        }

    }

    sys.air_last_received_id = 0;
    sys.message[0] = 0;
    display.display();
}

void display_logo() {
    display.drawXbm(0, 0, logo_width_s, logo_height_s, logo_bits_s);
    display.display();
    delay(1500);
    display.clear();
}

// -------- MSP and FC


void msp_get_state() {

    uint32_t planeModes;
    msp.getActiveModes(&planeModes);
    curr.state = bitRead(planeModes, 0);
}

void msp_get_name() {
    msp.request(MSP_NAME, &curr.name, sizeof(curr.name));
    curr.name[6] = '\0';
}

void msp_get_gps() {
    msp.request(MSP_RAW_GPS, &curr.gps, sizeof(curr.gps));
}

void msp_set_fc() {
    char j[5];
    curr.host = HOST_NONE;
    msp.request(MSP_FC_VARIANT, &j, sizeof(j));

    if (strncmp(j, "INAV", 4) == 0) {
        curr.host = HOST_INAV;
    }
    else if (strncmp(j, "BTFL", 4) == 0) {
        curr.host = HOST_BTFL;
    }

    if (curr.host == HOST_INAV || curr.host == HOST_BTFL) {
        msp.request(MSP_FC_VERSION, &curr.fcversion, sizeof(curr.fcversion));
    }
 }

 void msp_get_fcanalog() {
  msp.request(MSP_ANALOG, &curr.fcanalog, sizeof(curr.fcanalog));
}

void msp_send_radar(uint8_t i) {
    radarPos.id = i;
    radarPos.state = peers[i].state;
    radarPos.lat = peers[i].gps.lat; // x 10E7
    radarPos.lon = peers[i].gps.lon; // x 10E7
    radarPos.alt = peers[i].gps.alt * 100; // cm
    radarPos.heading = peers[i].gps.groundCourse / 10; // From ° x 10 to °
    radarPos.speed = peers[i].gps.groundSpeed; // cm/s
    radarPos.lq = peers[i].lq;
    msp.command2(MSP2_COMMON_SET_RADAR_POS , &radarPos, sizeof(radarPos), 0);
//    msp.command(MSP_SET_RADAR_POS , &radarPos, sizeof(radarPos), 0);
}

void msp_send_peers() {
    for (int i = 0; i < cfg.lora_nodes_max; i++) {
        if (peers[i].id > 0) {
            msp_send_radar(i);
        }
    }
}

void msp_send_peer(uint8_t peer_id) {
    if (peers[peer_id].id > 0) {
        msp_send_radar(peer_id);
    }
}

// -------- INTERRUPTS

const byte interruptPin = 0;
volatile int interruptCounter = 0;
int numberOfInterrupts = 0;

portMUX_TYPE mux = portMUX_INITIALIZER_UNLOCKED;

void IRAM_ATTR handleInterrupt() {
    portENTER_CRITICAL_ISR(&mux);

    if (sys.io_button_pressed == 0) {
        sys.io_button_pressed = 1;

        if (sys.phase > MODE_LORA_SYNC) {

            if (sys.display_page >= 3 + cfg.lora_nodes_max) {
                sys.display_page = 0;
            }
            else {
                sys.display_page++;
            }
        }
        else if (sys.phase == MODE_MENU) {
            sys.menu_line++;
            sys.menu_begin = millis();
            display.clear();
            if (sys.menu_line > 4) {
            sys.menu_line = 1;
            }
        }

        sys.io_button_released = millis();
    }
    portEXIT_CRITICAL_ISR(&mux);
}


// ----------------------------- setup

void setup() {

    sys.phase = MODE_START;

    pinMode(LED, OUTPUT);
    sys.io_led_blink = 0;

    display_init();
    display_logo();

    msp.begin(Serial1);
    Serial1.begin(115200, SERIAL_8N1, SERIAL_PIN_RX , SERIAL_PIN_TX);
    reset_peers();

    pinMode(interruptPin, INPUT);
    sys.io_button_pressed = 0;
    attachInterrupt(digitalPinToInterrupt(interruptPin), handleInterrupt, RISING);

