mistyk/inavradar-ESP32/src/main.cpp
    display.clear();
    display.display();

    sys.display_updated = 0;
    sys.menu_line = LORA_AIR_MODE_DEFAULT;
    sys.menu_begin = millis();

    sys.phase = MODE_MENU;
}

// ----------------------------------------------------------------------------- MAIN LOOP

void loop() {

    sys.now = millis();

// ---------------------- IO BUTTON

    if ((sys.now > sys.io_button_released + 150) && (sys.io_button_pressed == 1)) {
        sys.io_button_pressed = 0;
    }


// ---------------------- MENU

    if (sys.phase == MODE_MENU) {

        if (sys.now > (sys.menu_begin + sys.menu_timeout)) {  // End of the menu

            if (sys.menu_line == 4) {
                cfg.lora_air_mode = 2;
                sys.lora_no_tx = 1;
            }
            else {
                cfg.lora_air_mode = sys.menu_line;
            }

            display.clear();
            display.drawString(0, 0, "RADAR VERSION");
            display.drawString(90, 0, VERSION);
            display.drawString (0, 9, "HOST");
            display.display();

            sys.cycle_scan_begin = millis();
            sys.now = millis();

            curr.host = HOST_NONE;
            sys.phase = MODE_HOST_SCAN;

        }
        else { // Still in the menu
            if (sys.now > sys.display_updated + cfg.cycle_display / 5) {
                delay(50);

                display.drawProgressBar(0, 2, 25, 6, 100 * (millis() - sys.menu_begin) / sys.menu_timeout);

                display.drawString (33, 0, "Speed");
                display.drawString (69, 0, "Range");
                display.drawString (107, 0, "Max");

                display.drawString (6, 12, "R1");
                display.drawString (6, 24, "R2");
                display.drawString (6, 36, "R3");
                display.drawString (6, 48, "R2 Silent");

                display.drawXbm (36, 13, 8, 8, icon_sq1);
                display.drawXbm (44, 13, 8, 8, icon_sq1);
                display.drawXbm (52, 13, 8, 8, icon_sq1);

                display.drawXbm (36, 25, 8, 8, icon_sq1);
                display.drawXbm (44, 25, 8, 8, icon_sq1);
                display.drawXbm (52, 25, 8, 8, icon_sq0);

                display.drawXbm (36, 37, 8, 8, icon_sq1);
                display.drawXbm (44, 37, 8, 8, icon_sq0);
                display.drawXbm (52, 37, 8, 8, icon_sq0);

                display.drawXbm (70, 13, 8, 8, icon_sq1);
                display.drawXbm (78, 13, 8, 8, icon_sq0);
                display.drawXbm (86, 13, 8, 8, icon_sq0);

                display.drawXbm (70, 25, 8, 8, icon_sq1);
                display.drawXbm (78, 25, 8, 8, icon_sq1);
                display.drawXbm (86, 25, 8, 8, icon_sq0);

                display.drawXbm (70, 37, 8, 8, icon_sq1);
                display.drawXbm (78, 37, 8, 8, icon_sq1);
                display.drawXbm (86, 37, 8, 8, icon_sq1);

                display.drawString (116, 12, "8");
                display.drawString (116, 24, "4");
                display.drawString (116, 36, "4");

                display.drawRect(0, sys.menu_line * 12, 127, 12);

                display.display();
                sys.display_updated = millis();
            }
        }
    }

// ---------------------- HOST SCAN

    if (sys.phase == MODE_HOST_SCAN) {

        if ((sys.now > (sys.cycle_scan_begin + cfg.msp_fc_timeout)) || (curr.host != HOST_NONE)) {  // End of the host scan

            if (curr.host != HOST_NONE) {
                msp_get_name();
            }

            if (curr.name[0] == '\0') {
                for (int i = 0; i < 4; i++) {
                curr.name[i] = (char) random(65, 90);
                curr.name[4] = 0;
                }
            }

            curr.gps.fixType = 0;
            curr.gps.lat = 0;
            curr.gps.lon = 0;
            curr.gps.alt = 0;
            curr.id = 0;

            if (curr.host > 0) {
                display.drawString (35, 9, String(host_name[curr.host]) + " " + String(curr.fcversion.versionMajor) + "."  + String(curr.fcversion.versionMinor) + "." + String(curr.fcversion.versionPatchLevel));
            }
            else {
                display.drawString (35, 9, String(host_name[curr.host]));
            }

            display.drawProgressBar(0, 53, 40, 6, 100);
            display.display();

            lora_set_mode(cfg.lora_air_mode);
            lora_init();
            LoRa.sleep();
            LoRa.receive();

            display.drawProgressBar(0, 53, 40, 6, 100);
            display.drawString (0, 18, "SCAN R" + String(cfg.lora_air_mode));
            display.display();

            sys.cycle_scan_begin = millis();
            sys.phase = MODE_LORA_INIT;

        } else { // Still scanning
            if (sys.now > sys.display_updated + cfg.cycle_display / 2) {

                delay(50);
                
                msp_set_fc();

                display.drawProgressBar(0, 53, 40, 6, 100 * (millis() - sys.cycle_scan_begin) / cfg.msp_fc_timeout);
                display.display();
                sys.display_updated = millis();
                
                
            }
        }
    }

// ---------------------- LORA INIT

    if (sys.phase == MODE_LORA_INIT) {
        if (sys.now > (sys.cycle_scan_begin + cfg.cycle_scan)) {  // End of the scan, set the ID then sync

            sys.num_peers = count_peers();

            if (sys.num_peers >= cfg.lora_nodes_max) {
                sys.lora_no_tx = 1;
            }
            else {
                pick_id();
            }
            sys.display_page = 0;
            sys.phase = MODE_LORA_SYNC;

        } else { // Still scanning
            if (sys.now > sys.display_updated + cfg.cycle_display / 2) {
                for (int i = 0; i < cfg.lora_nodes_max; i++) {
                    if (peers[i].id > 0) {
                        display.drawString(40 + peers[i].id * 8, 18, String(peer_slotname[peers[i].id]));
                    }
                }
                display.drawProgressBar(40, 53, 86, 6, 100 * (millis() - sys.cycle_scan_begin) / cfg.cycle_scan);

